micropython/micropython/stmhal/hal/inc/stm32f2xx_hal_can.h
  uint32_t FilterFIFOAssignment;  /*!< Specifies the FIFO (0 or 1) which will be assigned to the filter.
                                       This parameter can be a value of @ref CAN_filter_FIFO */
  
  uint32_t FilterNumber;          /*!< Specifies the filter which will be initialized. 
                                       This parameter must be a number between Min_Data = 0 and Max_Data = 27 */

  uint32_t FilterMode;            /*!< Specifies the filter mode to be initialized.
                                       This parameter can be a value of @ref CAN_filter_mode */

  uint32_t FilterScale;           /*!< Specifies the filter scale.
                                       This parameter can be a value of @ref CAN_filter_scale */

  uint32_t FilterActivation;      /*!< Enable or disable the filter.
                                       This parameter can be set to ENABLE or DISABLE. */
                                       
  uint32_t BankNumber;            /*!< Select the start slave bank filter
                                       This parameter must be a number between Min_Data = 0 and Max_Data = 28 */ 
  
}CAN_FilterConfTypeDef;

/** 
  * @brief  CAN Tx message structure definition  
  */
typedef struct
{
  uint32_t StdId;    /*!< Specifies the standard identifier.
                          This parameter must be a number between Min_Data = 0 and Max_Data = 0x7FF */ 
                        
  uint32_t ExtId;    /*!< Specifies the extended identifier.
                          This parameter must be a number between Min_Data = 0 and Max_Data = 0x1FFFFFFF */ 
                        
  uint32_t IDE;      /*!< Specifies the type of identifier for the message that will be transmitted.
                          This parameter can be a value of @ref CAN_identifier_type */

  uint32_t RTR;      /*!< Specifies the type of frame for the message that will be transmitted.
                          This parameter can be a value of @ref CAN_remote_transmission_request */                         

  uint32_t DLC;      /*!< Specifies the length of the frame that will be transmitted.
                          This parameter must be a number between Min_Data = 0 and Max_Data = 8 */

  uint32_t Data[8];  /*!< Contains the data to be transmitted. 
                          This parameter must be a number between Min_Data = 0 and Max_Data = 0xFF */
   
}CanTxMsgTypeDef;

/** 
  * @brief  CAN Rx message structure definition  
  */
typedef struct
{
  uint32_t StdId;       /*!< Specifies the standard identifier.
                             This parameter must be a number between Min_Data = 0 and Max_Data = 0x7FF */ 

  uint32_t ExtId;       /*!< Specifies the extended identifier.
                             This parameter must be a number between Min_Data = 0 and Max_Data = 0x1FFFFFFF */ 

  uint32_t IDE;         /*!< Specifies the type of identifier for the message that will be received. 
                             This parameter can be a value of @ref CAN_identifier_type */

  uint32_t RTR;         /*!< Specifies the type of frame for the received message.
                             This parameter can be a value of @ref CAN_remote_transmission_request */

  uint32_t DLC;         /*!< Specifies the length of the frame that will be received.
                             This parameter must be a number between Min_Data = 0 and Max_Data = 8 */

  uint32_t Data[8];     /*!< Contains the data to be received. 
                             This parameter must be a number between Min_Data = 0 and Max_Data = 0xFF */

  uint32_t FMI;         /*!< Specifies the index of the filter the message stored in the mailbox passes through.
                             This parameter must be a number between Min_Data = 0 and Max_Data = 0xFF */
                        
  uint32_t FIFONumber;  /*!< Specifies the receive FIFO number. 
                             This parameter can be CAN_FIFO0 or CAN_FIFO1 */
                       
}CanRxMsgTypeDef;

/** 
  * @brief  CAN handle Structure definition  
  */ 
typedef struct
{
  CAN_TypeDef                 *Instance;  /*!< Register base address          */
  
  CAN_InitTypeDef             Init;       /*!< CAN required parameters        */
  
  CanTxMsgTypeDef*            pTxMsg;     /*!< Pointer to transmit structure  */

  CanRxMsgTypeDef*            pRxMsg;     /*!< Pointer to reception structure */
  
  __IO HAL_CAN_StateTypeDef   State;      /*!< CAN communication state        */
  
  HAL_LockTypeDef             Lock;       /*!< CAN locking object             */
  
  __IO uint32_t               ErrorCode;  /*!< CAN Error code                 */
  
}CAN_HandleTypeDef;

/* Exported constants --------------------------------------------------------*/

/** @defgroup CAN_Exported_Constants
  * @{
  */

/** @defgroup HAL CAN Error Code 
  * @{
  */
#define   HAL_CAN_ERROR_NONE      0x00    /*!< No error             */
#define   HAL_CAN_ERROR_EWG       0x01    /*!< EWG error            */   
#define   HAL_CAN_ERROR_EPV       0x02    /*!< EPV error            */
#define   HAL_CAN_ERROR_BOF       0x04    /*!< BOF error            */
#define   HAL_CAN_ERROR_STF       0x08    /*!< Stuff error          */
#define   HAL_CAN_ERROR_FOR       0x10    /*!< Form error           */
#define   HAL_CAN_ERROR_ACK       0x20    /*!< Acknowledgment error */
#define   HAL_CAN_ERROR_BR        0x40    /*!< Bit recessive        */
#define   HAL_CAN_ERROR_BD        0x80    /*!< LEC dominant         */
#define   HAL_CAN_ERROR_CRC       0x100   /*!< LEC transfer error   */
/**
  * @}
  */  


/** @defgroup CAN_InitStatus 
  * @{
  */
#define CAN_INITSTATUS_FAILED       ((uint8_t)0x00)  /*!< CAN initialization failed */
#define CAN_INITSTATUS_SUCCESS      ((uint8_t)0x01)  /*!< CAN initialization OK */
/**
  * @}
  */

/** @defgroup CAN_operating_mode 
  * @{
  */
#define CAN_MODE_NORMAL             ((uint32_t)0x00000000)                     /*!< Normal mode   */
#define CAN_MODE_LOOPBACK           ((uint32_t)CAN_BTR_LBKM)                   /*!< Loopback mode */
#define CAN_MODE_SILENT             ((uint32_t)CAN_BTR_SILM)                   /*!< Silent mode   */
#define CAN_MODE_SILENT_LOOPBACK    ((uint32_t)(CAN_BTR_LBKM | CAN_BTR_SILM))  /*!< Loopback combined with silent mode */

